# Tyler Banks
## Week 12 - 04/10/21
### Python - Pandas Series

In [1]:
import numpy as np

from pandas import Series,DataFrame
import pandas as pd

In [2]:
s = Series([2,5,7,-9,8,4])

s

0    2
1    5
2    7
3   -9
4    8
5    4
dtype: int64

In [3]:
s.values

array([ 2,  5,  7, -9,  8,  4], dtype=int64)

In [4]:
s.index

RangeIndex(start=0, stop=6, step=1)

In [5]:
# values and index
summer_olympics = Series([2520,1122,937,847,713],index = ['USA','Russia','Germany','UK','France'])

In [6]:
summer_olympics

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [7]:
summer_olympics['USA']

2520

In [8]:
summer_olympics[summer_olympics>800]

USA        2520
Russia     1122
Germany     937
UK          847
dtype: int64

In [9]:
'USA' in summer_olympics

True

In [10]:
'China' in summer_olympics

False

In [11]:
#Convert series to dictionary
summer_olympics_dict = summer_olympics.to_dict()

summer_olympics_dict

{'USA': 2520, 'Russia': 1122, 'Germany': 937, 'UK': 847, 'France': 713}

In [12]:
#convert dict to Series

summer_olympics_Series = Series(summer_olympics_dict)

summer_olympics_Series

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [13]:
countries = ['Russia','France','Germany','USA','UK','Italy']

In [14]:
#redefine a series

s2 = Series(summer_olympics_dict, index = countries)

s2

Russia     1122.0
France      713.0
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
dtype: float64

In [15]:
pd.isnull(s2)

Russia     False
France     False
Germany    False
USA        False
UK         False
Italy       True
dtype: bool

In [16]:
pd.notnull(s2)

Russia      True
France      True
Germany     True
USA         True
UK          True
Italy      False
dtype: bool

In [17]:
summer_olympics_Series

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [18]:
summer_olympics_Series + s2

France     1426.0
Germany    1874.0
Italy         NaN
Russia     2244.0
UK         1694.0
USA        5040.0
dtype: float64

In [19]:
s2.name = "Summer Olympics"

In [20]:
s2

Russia     1122.0
France      713.0
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
Name: Summer Olympics, dtype: float64

In [21]:
s2.index.name='Countries'

In [22]:
s2

Countries
Russia     1122.0
France      713.0
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
Name: Summer Olympics, dtype: float64

In [23]:
#DataFrame

data_dict = {'states': ['Ohio','Ohio','Virginia','Ohio','Hawaii','Alaska'],
             'year': [2000,2001, 2002, 2003, 2002, 2000],
             'pop':([1.5, 1.7, 3.6, 2.2, 3.2, 0.7])}

df = pd.DataFrame(data_dict)

df

     states  year  pop
0      Ohio  2000  1.5
1      Ohio  2001  1.7
2  Virginia  2002  3.6
3      Ohio  2003  2.2
4    Hawaii  2002  3.2
5    Alaska  2000  0.7

In [24]:
df.head()

     states  year  pop
0      Ohio  2000  1.5
1      Ohio  2001  1.7
2  Virginia  2002  3.6
3      Ohio  2003  2.2
4    Hawaii  2002  3.2

In [25]:
df.tail()

     states  year  pop
1      Ohio  2001  1.7
2  Virginia  2002  3.6
3      Ohio  2003  2.2
4    Hawaii  2002  3.2
5    Alaska  2000  0.7

In [26]:
pd.DataFrame(data_dict, columns = ['year','states','pop'])

   year    states  pop
0  2000      Ohio  1.5
1  2001      Ohio  1.7
2  2002  Virginia  3.6
3  2003      Ohio  2.2
4  2002    Hawaii  3.2
5  2000    Alaska  0.7

In [27]:
df2 = pd.DataFrame(data_dict, columns = ['year','states','pop', 'debt'],
            index = ['one','two','three','four','five','six'])

df2

       year    states  pop debt
one    2000      Ohio  1.5  NaN
two    2001      Ohio  1.7  NaN
three  2002  Virginia  3.6  NaN
four   2003      Ohio  2.2  NaN
five   2002    Hawaii  3.2  NaN
six    2000    Alaska  0.7  NaN

In [28]:
df2.columns

Index(['year', 'states', 'pop', 'debt'], dtype='object')

In [29]:
df2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [30]:
df2['states']

one          Ohio
two          Ohio
three    Virginia
four         Ohio
five       Hawaii
six        Alaska
Name: states, dtype: object

In [31]:
df2.year

one      2000
two      2001
three    2002
four     2003
five     2002
six      2000
Name: year, dtype: int64

In [32]:
df2.loc['three']

year          2002
states    Virginia
pop            3.6
debt           NaN
Name: three, dtype: object

In [33]:
df2['debt'] = 10.5

df2

       year    states  pop  debt
one    2000      Ohio  1.5  10.5
two    2001      Ohio  1.7  10.5
three  2002  Virginia  3.6  10.5
four   2003      Ohio  2.2  10.5
five   2002    Hawaii  3.2  10.5
six    2000    Alaska  0.7  10.5

In [34]:
df2['debt'] = np.arange(6.)

df2

       year    states  pop  debt
one    2000      Ohio  1.5   0.0
two    2001      Ohio  1.7   1.0
three  2002  Virginia  3.6   2.0
four   2003      Ohio  2.2   3.0
five   2002    Hawaii  3.2   4.0
six    2000    Alaska  0.7   5.0

In [35]:
s3 = pd.Series([-1.2,-1.5,-1.7],index=['two','four','five'])

s3

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [36]:
df2['debt'] = s3

In [37]:
df2

       year    states  pop  debt
one    2000      Ohio  1.5   NaN
two    2001      Ohio  1.7  -1.2
three  2002  Virginia  3.6   NaN
four   2003      Ohio  2.2  -1.5
five   2002    Hawaii  3.2  -1.7
six    2000    Alaska  0.7   NaN

In [38]:
df2['east coast'] = df2['states'] == 'Virginia'

In [39]:
df2

       year    states  pop  debt  east coast
one    2000      Ohio  1.5   NaN       False
two    2001      Ohio  1.7  -1.2       False
three  2002  Virginia  3.6   NaN        True
four   2003      Ohio  2.2  -1.5       False
five   2002    Hawaii  3.2  -1.7       False
six    2000    Alaska  0.7   NaN       False

In [40]:
df2.columns

Index(['year', 'states', 'pop', 'debt', 'east coast'], dtype='object')

In [42]:
#nested dictionary

pop_dict = {'Nevada': {2001: 2.4, 2002: 2.9},
           'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

pop_dict

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [43]:
df3 = pd.DataFrame(pop_dict)

df3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [44]:
df3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [46]:
DataFrame(df3,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [47]:
df3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [48]:
df3['Ohio'][:-1]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [49]:
df3['Nevada'][:1]

2001    2.4
Name: Nevada, dtype: float64

In [50]:
df3['Ohio'][:2]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64